#support
brew 'mas'
brew 'pkg-config'

# foundation
brew 'bash'
brew 'bat'
brew 'cocoapods'
brew 'composer'
brew 'coreutils'
brew 'diff-so-fancy'
brew 'fd'
brew 'fzf'
brew 'git'
brew 'git-open'
brew 'gnupg2'
brew 'httpie'
brew 'libmemcached'
brew 'memcached'
brew 'mysql'
brew 'nginx'
brew 'node'
brew 'php'
brew 'php@7.2'
brew 'php@7.3'
brew 'ripgrep'
brew 'ruby'
brew 'tree'
brew 'vim'
brew 'z'

# dependencies
brew 'zlib' # memcached
