#support
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
brew 'mas'

# dependencies
brew 'pkg-config' # * (memcached)
brew 'zlib' # memcached

# foundation
brew 'bash'
brew 'bat'
brew 'cocoapods'
brew 'composer'
brew 'coreutils'
brew 'diff-so-fancy'
brew 'fd'
brew 'ffmpeg'
brew 'findutils'
brew 'fzf'
brew 'gifsicle'
brew 'git'
brew 'git-open'
brew 'gnu-sed'
brew 'gnupg'
brew 'grep'
brew 'httpie'
brew 'jpegoptim'
brew 'libmemcached'
brew 'memcached'
brew 'mysql'
brew 'nginx'
brew 'node'
brew 'optipng'
brew 'php'
brew 'php@7.0'
brew 'php@7.1'
brew 'php@7.2'
brew 'php@7.3'
brew 'pngquant'
brew 'ripgrep'
brew 'svgo'
brew 'tree'
brew 'vim'
brew 'wget'
brew 'z'
brew 'zsh'

# fonts
cask 'font-fira-code'

# apps
cask 'firefox-developer-edition'
cask 'imageoptim'
cask 'iterm2'
cask 'notion'
cask 'postman'
cask 'sequel-pro'
cask 'skype'
cask 'slack'
cask 'telegram'
cask 'screenflow'
cask '1password'
# MAS apps
