tap 'homebrew/cask'
tap 'homebrew/cask-drivers'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/services'
tap 'buo/cask-upgrade'
tap 'timothyye/tap'
tap 'bgdevlab/navicat-for-postgresql'
tap 'shivammathur/php'
tap 'shivammathur/extensions'

# dependencies
brew 'pkg-config' # bunch of things

# foundation
brew 'pure'
brew 'bash-completion'
brew 'bat'
brew 'composer'
brew 'coreutils'
brew 'exa'
brew 'fd'
brew 'findutils'
brew 'fzf'
brew 'gettext'
brew 'git-delta'
brew 'git-flow'
brew 'git-open'
brew 'git'
brew 'gnu-sed'
brew 'gnu-which'
brew 'gnupg'
brew 'grep'
brew 'htop'
brew 'httpie'
brew 'java'
brew 'jenv'
brew 'jq'
brew 'less'
brew 'mackup'
brew 'mas'
brew 'node'
# brew 'php@8.0'
brew 'postgresql@9.5'
brew 'redis'
brew 'ripgrep'
brew 'shellcheck'
brew 'shivammathur/php/php@7.0'
brew 'shivammathur/php/php@8.0'
brew 'shivammathur/php/php@8.1'
brew 'skm'
brew 'sqlite'
brew 'svn' # source-code-pro requires it
brew 'tree'
brew 'vagrant-completion'
brew 'vim'
brew 'wget'
brew 'wrk'
brew 'yarn'
brew 'z'
brew 'zlib'
brew 'zsh-autosuggestions'
brew 'zsh-history-substring-search'
brew 'zsh-syntax-highlighting'
brew 'zsh'
# apps
cask 'docker'
cask 'firefox-developer-edition'
cask 'google-chrome'
cask 'imageoptim'
cask 'helo'
cask 'kitty'
cask 'navicat-for-postgresql'
cask 'pinegrow'
cask 'postbox'
cask 'postman'
cask 'zoom'
cask 'gitkraken'
cask 'launchcontrol'
cask 'rectangle'
cask 'jetbrains-toolbox'
cask 'typora'
cask 'visual-studio-code'
cask 'vagrant'
cask 'vmware-fusion'
#cask 'vagrant-manager'
#cask 'navicat' # https://download3.navicat.com/download/navicat120_pgsql_en.dmg
cask 'vlc'

# Key management https://golangrepo.com/repo/TimothyYe-skm-go-devops-tools

# fonts
cask 'font-jetbrains-mono' # may not be required given jetbrains-toolbox install
cask 'font-jetbrains-mono-nerd-font'
cask 'font-source-code-pro'
cask 'font-inconsolata'
cask 'font-inconsolata-nerd-font'
cask 'font-hasklig'
cask 'font-hack'
cask 'font-hack-nerd-font'
cask 'font-monoid'
cask 'font-monoid-nerd-font'
cask 'font-dejavu'


# work - app store 
mas '1Password 7', id: 1333542190
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'Pixelmator Pro', id: 1289583905
mas 'Slack', id: 803453959
mas 'Medis - GUI for Redis', id: 1063631769
mas 'Apple Remote Desktop', id: 409907375  
mas 'Eye-Friendly', id: 587769990
mas 'Paste - Clipboard Manager', id: 967805235
mas 'SQLiteFlow - SQLite Editor', id: 1378587993

# =========================================================
# work - todo
#
# MongoDB Compass
# Patterns
# PHPMonitor
# serial
# serialtools
# tinkerwell
# xcode
# sip
# mas 'Jump Desktop'
# LittleSnitch



# =========================================================
#   home
# =========================================================

brew 'handbrake'

mas 'Affinity Photo', id: 824183456
mas 'Affinity Designer', id: 824171161
mas 'Gemini 2', id: 1090488118  
mas 'ReadKit: Read Later and RSS', id: 588726889  
mas 'DaisyDisk', id: 411643860  

# Office 365 - not standalone 2019 compatible.
# mas 'Microsoft Word', id: 462054704
# mas 'Microsoft Excel', id: 462058435
# mas 'Microsoft PowerPoint', id: 462062816
# mas 'Microsoft OneNote', id: 784801555
mas 'WhatsApp Desktop', id: 1147396723


# =========================================================
#   Manual installs
# =========================================================

# BusyCal https://www.busymac.com/download/bcl-2021.4.3.zip # subscription model on App Store only!
# mas 'BusyCal', id: 1173663647  

# cask 'shimo' # use shimo 4 - Shimo_4.1.5.1_8837.zip

# Having issues with shared apps amongst family members
# mas 'Folx GO+', id: 823528286  
# mas 'Transmit 5', id: 1436522307
# mas 'Live Home 3D Pro: Design House', id: 1066145115


# not available anymore - only from historic app purchases
# mas BarnQR
# mas screenshotplus


# =========================================================
#   No installers available 
# =========================================================

# =========================================================
#   home - todo
# =========================================================
# surfshark
# pdfexport
# pdfoptim
# NTFS for MAC
# mas 'Home Designer Pro 2021'
# mas 'Photos Exit Editor'
# mas 'World Clock Pro'
# mas 'ControllerForHomeKit'
# mas Invoker
# mas Banktivity 7
