# tap 'homebrew/cask'
# tap 'homebrew/cask-drivers'
# tap 'homebrew/cask-fonts'
# tap 'homebrew/cask-versions'
tap 'timothyye/tap'
tap 'homebrew/services'
tap 'buo/cask-upgrade'

# -----------------------------------------------------------------------------

# dependencies
brew 'pkg-config' # bunch of things

# foundation
# brew 'composer' # Herd manage this
# brew 'exa'
# brew 'nginx'  # Herd manage this
# brew 'nvm'  # Herd manage this
# brew 'php@8.0'
# brew 'pnpm'  # curl -fsSL https://get.pnpm.io/install.sh | env PNPM_VERSION=6.32.1  sh -
# brew 'postgresql@9.5' - using mcaports version as no longer available
# brew 'redis@6.2', restart_service: true, link: true, conflicts_with: ["redis"]  # Herd manage this
brew 'bash-completion'
brew 'bat'
brew 'cantino/mcfly/mcfly'
brew 'cheat'
brew 'coreutils'
brew 'curlie'
brew 'docutils'
brew 'duf'
brew 'dust'
brew 'fd'
brew 'findutils'
brew 'fzf'
brew 'gettext'
brew 'git'
brew 'git-delta'
brew 'git-flow'
brew 'git-open'
brew 'gnu-sed'
brew 'gnu-which'
brew 'gnupg'
brew 'gping'
brew 'grep'
brew 'gtop'
brew 'htop'
brew 'httpie'
brew 'java'
brew 'jenv'
brew 'jq'
# brew 'k9s'
# brew 'kdiff3'
# brew 'kustomize'
# brew 'kube-ps1'
# brew 'kubernetes-cli'
# brew 'kubernetes-helm'
brew 'lazydocker'
brew 'lazygit'
brew 'launchctl-completion'
brew 'less'
brew 'lsd'
brew 'lunchy'
brew 'mailpit'
brew 'mas'
brew 'maven'
brew 'mkcert'
# mtr 'traceroute' and 'ping' in a single tool
brew 'mtr'
brew 'nss'
brew 'openjdk8'
brew 'openjdk@17'
brew 'openjdk@23'
brew 'poppler'
brew 'pstree'
brew 'pure'
brew 'pyenv'
brew 'rbenv'
brew 'ripgrep'
brew 'ripgrep-all'
brew 'ruby'
brew 'shellcheck'
brew 'skm'
brew 'sqlite'
brew 'starship'
brew 'tldr'
brew 'tree'
brew 'vagrant-completion'
brew 'vim'
brew 'wget'
brew 'wrk'
brew 'yarn'
brew 'yq'
brew 'z'
brew 'zlib'
brew 'orbstack'

#
brew 'zsh-autosuggestions'
brew 'zsh-history-substring-search'
brew 'zsh-syntax-highlighting'
brew 'zsh'

#
# apps
#

cask 'google-chrome'
cask 'imageoptim'
cask 'herd'
cask 'raycast'
cask 'zoom'
cask 'rectangle'
cask 'visual-studio-code'
cask 'vagrant'
cask 'vlc'
cask 'microsoft-teams'


# Optional
# cask 'dbngin'
# cask 'firefox-developer-edition'
cask 'launchcontrol'
# cask 'mongodb-compass'
cask 'obsidian'
# cask 'postman'
cask 'raspberry-pi-imager'
# cask 'vagrant-manager'
# cask 'vnc-viewer'


# fonts
cask 'font-jetbrains-mono' # may not be required given jetbrains-toolbox install
cask 'font-jetbrains-mono-nerd-font'
cask 'font-inconsolata'
cask 'font-inconsolata-nerd-font'
cask 'font-hasklig'
cask 'font-hack'
cask 'font-hack-nerd-font'
cask 'font-monoid'
cask 'font-monoid-nerd-font'
cask 'font-dejavu'

#
# paid apps (license required)
#
cask '1password'
cask 'cleanshot'
cask 'gitkraken'
cask 'handbrake'
cask 'helo'
cask 'jetbrains-toolbox'
cask 'little-snitch'
cask 'monitorcontrol'
cask 'notion'
# cask 'pinegrow'
cask 'shimo'
# cask 'tinkerwell'
cask 'typora'

# AppStore
# mas 'Affinity Designer', id: 824171161
# mas 'Affinity Photo', id: 824183456
mas 'Apple Remote Desktop', id: 409907375
# mas 'Banktivity', id: 1480779512
# mas 'Controller for HomeKit', id: 1198176727
mas 'DaisyDisk', id: 411643860
mas 'Eye-Friendly', id: 587769990
mas 'Gemini 2', id: 1090488118
# mas 'Home Assistant', id: 1099568401
# mas 'HomeCam for HomeKit', id: 1292995895
# mas 'HomePass for HomeKit', id: 1330266650
mas 'Jump Desktop (RDP, VNC, Fluid)', id: 524141863
mas 'Medis - GUI for Redis', id: 1063631769
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'Paste - Clipboard Manager', id: 967805235
mas 'Pixelmator Pro', id: 1289583905
mas 'ReadKit: Read Later and RSS', id: 588726889
mas 'SQLiteFlow - SQLite Editor', id: 1378587993
# mas 'SerialTools', id: 611021963
mas 'Slack', id: 803453959
mas 'Surfshark', id: 1437809329
# mas 'WhatsApp Desktop', id: 1147396723
# mas 'World Clock Pro', id: 858446756

# Office -  Office 365 - not standalone 2019 compatible - use manual installs Microsoft_Office_16.29.19090802_HomeStudent_Installer

#
# AppStore Account Switching - Manually Install from AppStore (other account)
#       Having issues with shared apps amongst family members - app purchased against other accounts
#

# mas 'BarnQR', id:1059929763'
# mas 'Entropy', id: 437151949
# mas 'Folx GO+', id: 823528286
# mas 'Live Home 3D Pro: Design House', id: 1066145115
# mas 'NetAdmin Pro', id: 675649574
# mas 'PDFOptim - The PDF Compressor', id: 621276561
# mas 'Patterns', id:429449079'
# mas 'Photos Exif Editor', id: 1202851767
# mas 'Serial', id: 877615577
# mas 'Transmit 5', id: 1436522307
